app/Models/AdminModel.php

	function GetAllcity()
	{
		$builder = $this->db->table('city');
		$builder->select('*');
		return $builder->get()->getResult();
---
SELECT *
FROM `city`

	function checkVehicleStatus($boarding_time, $vehicle_id)
	{
		$builder = $this->db->table('service_details');
		$builder->select('id');
		$builder->where('vehicle_id', $vehicle_id);
		$builder->where('boarding_date <=', $boarding_time);
		$builder->where('arrival_datetime >=', $boarding_time);
		return $builder->get()->getResult();
---
SELECT `id`
FROM `service_details`
WHERE `vehicle_id` = '1'
AND `boarding_date` <= '2024-04-14T16:30'
AND `arrival_datetime` >= '2024-04-14T16:30'

	function getAllService()
	{
		$builder = $this->db->table('service_details');
		$builder->select('service_details.*,vehicle.type_id,vehicle.model_name,vehicle.regd_no,vehicle.no_of_sit,user.full_name,from_city.city_name as from_city_name,to_city.city_name as to_city_name');
		$builder->join('vehicle_details vehicle', 'vehicle.id = service_details.vehicle_id');
		$builder->join('city from_city', 'from_city.city_id = service_details.from_city');
		$builder->join('city to_city', 'to_city.city_id = service_details.from_city');
		$builder->join('user', 'user.id = service_details.vendor_id');
		return $builder->get()->getResult();
---
SELECT `service_details`.*, `vehicle`.`type_id`, `vehicle`.`model_name`, `vehicle`.`regd_no`, `vehicle`.`no_of_sit`, `user`.`full_name`, `from_city`.`city_name` as `from_city_name`, `to_city`.`city_name` as `to_city_name`
FROM `service_details`
JOIN `vehicle_details` `vehicle` ON `vehicle`.`id` = `service_details`.`vehicle_id`
JOIN `city` `from_city` ON `from_city`.`city_id` = `service_details`.`from_city`
JOIN `city` `to_city` ON `to_city`.`city_id` = `service_details`.`from_city`
JOIN `user` ON `user`.`id` = `service_details`.`vendor_id`